{"config": [{"config": {"name": "zeropadding2d_1", "trainable": true, "padding": [2, 2], "batch_input_shape": [null, 28, 28, 1], "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "name": "convolution2d_1", "W_regularizer": null, "border_mode": "valid", "activation": "linear", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 6, "nb_row": 6, "nb_filter": 24, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "batchnormalization_1", "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_2", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "name": "convolution2d_2", "W_regularizer": null, "border_mode": "valid", "activation": "linear", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "nb_filter": 48, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "batchnormalization_2", "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_3", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "name": "convolution2d_3", "W_regularizer": null, "border_mode": "valid", "activation": "linear", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_col": 4, "nb_row": 4, "nb_filter": 64, "trainable": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "batchnormalization_3", "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null, "axis": -1, "trainable": true, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 3136, "b_constraint": null, "W_regularizer": null, "name": "dense_1", "input_dim": 576, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "W_constraint": null, "batch_input_shape": [null, 576], "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 10, "b_constraint": null, "W_regularizer": null, "name": "dense_2", "input_dim": 3136, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dtype": "float32", "trainable": true, "W_constraint": null, "batch_input_shape": [null, 3136], "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}